---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DocumentEntryPoint..::..PlanTopologies Property
DocumentEntryPoint Class See Also Send Feedback
---

Gets the PlanTopologies of the current project.

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | PlanTopologies | Get the PlanTopologies of the current project in the last phase. (Inherited from Document.) |
|  | [PlanTopologies[([( Phase])]) ](6cead23c-595a-8f54-8692-aa9daad9fb8d.md) | Gets the PlanTopologies of the current project in a given phase. (Inherited from Document.) |

# See Also

DocumentEntryPoint Class

DocumentEntryPoint Members

Autodesk.Revit.DB.Macros Namespace